Revit 2024 API
BuiltInFailures.ConnectorFailures.JointTypeMismatch Property
 The element has a connector with a fitting joint type mismatch
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId JointTypeMismatch { get; }
Visual Basic
Public Shared ReadOnly Property JointTypeMismatch As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ JointTypeMismatch {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ConnectorFailures Class
Autodesk.Revit.DB Namespace